CRNBuilder-commented/data/HM1_bluff-body_flame/case/0/Zvar
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      csiv2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuelinlet           
    {
	    type 		    fixedValue;
        value           uniform 0;
    }

    airinlet           
    {
	    type 		    fixedValue;
        value           uniform 0;
    }

    outlet          
    {
        type            zeroGradient;
    }

    leftside       
    {
        type            zeroGradient;
    }

    bluffbody       
    {
        type            zeroGradient;
    }

    front    
    {
        type            wedge;
    }

    back    
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }

// ************************************************************************* //
